package models

var (
	ErrAddDataInDB = "произошла ошибка при записи данных в базу данных"
	ErrGetDataInDB = "произошла ошибка при получении данных из базы данных"
	ErrUpdDataInDB = "произошла ошибка при обновлении данных в базе данных"
	ErrHashPass    = "произошла ошибка хеширования пароля"
	ErrAddFiles    = "произошла ошибка при работе с файлом"
	ErrTokenAuth   = "произошла ошибка при работе с токеном"
	ErrParseTMP    = "произошла ошибка при отображении страницы"
	ErrRequest     = "произошла ошибка при обработке данных"
	ErrFileRequest = "произошла ошибка при обработке файла"	
)
